Revit 2027 API
DuctShape Enumeration
 Enumerated type listing possible shapes for ducts.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DuctShape
Public Enumeration DuctShape
public enum class DuctShape
type DuctShape
Members
Member name | Value | Description
Oval | 2 |  Oval duct shape.
Rectangular | 1 |  Rectangular duct shape.
Round | 0 |  Round duct shape.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace